app/controllers/carts_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 04 Mar 2016 05:28:24 UTC +00:00], ["updated_at", Fri, 04 Mar 2016 05:28:24 UTC +00:00]]
---
  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]
---
  def destroy
    @cart.destroy if @cart.id == session[:cart_id]