app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id);
    session[:counter]=0
    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 26 Feb 2016 03:47:59 UTC +00:00], ["updated_at", Fri, 26 Feb 2016 03:47:59 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", Fri, 26 Feb 2016 03:47:59 UTC +00:00], ["product_id", 1], ["updated_at", Fri, 26 Feb 2016 03:47:59 UTC +00:00]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 13  [["quantity", 2], ["updated_at", Fri, 04 Mar 2016 03:11:11 UTC +00:00]]

  def destroy
    current_cart=@line_item.cart
    @line_item.destroy
---
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 30]]

    def set_line_item
      @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "30"]]